[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:44:16
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
               )}
 
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:44:16
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
               )}
 
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
