[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:3:59
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestCreatePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create Page Placeholder</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RecommendationRequestCreatePage() {}
 
killedBy: RecommendationRequestCreatePage tests renders without crashing
statusReason: Unable to find an element with the text: Create Page Placeholder. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
