[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestIndexPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index Page Placeholder</h1>
-        <p>Temp content for Index Page</p>
-        <a href="/recommendationrequest/create">Create</a> |{" "}
-        <a href="/recommendationrequest/edit/1">Edit</a>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RecommendationRequestIndexPage() {}
 
killedBy: RecommendationRequestIndexPage tests renders without crashing
statusReason: Unable to find an element with the text: Index Page Placeholder. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
