[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequest/all"],
-    { method: "GET", url: "/api/recommendationrequest/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: RecommendationRequestIndexPage tests renders three recommendationRequests correctly for regular user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
