[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:9:42
 import { toast } from "react-toastify";
 
 // eslint-disable-next-line react-refresh/only-export-components
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 // eslint-disable-next-line react-refresh/only-export-components
killedBy: RecommendationRequestTable tests onDeleteSuccess displays the correct message in console
statusReason: expected "log" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:15:47
 }
 
 // eslint-disable-next-line react-refresh/only-export-components
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export default function RecommendationRequestTable({ requests, currentUser }) {
killedBy: RecommendationRequestTable tests cellToAxiosParamsDelete returns correct params
statusReason: expected undefined to deeply equal { …(3) }

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:16:10
 
 // eslint-disable-next-line react-refresh/only-export-components
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: RecommendationRequestTable tests cellToAxiosParamsDelete returns correct params
statusReason: expected {} to deeply equal { …(3) }

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:29:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/recommendationrequest/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/recommendationrequest/edit/2' ]

Received: 

  1st vi.fn() call:

  [
-   "/recommendationrequest/edit/2",

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:64:20
     },
     {
       header: "Date Requested",
-      accessorKey: "dateRequested",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateRequested"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:70:5
       header: "Date Needed",
       accessorKey: "dateNeeded",
     },
-    {
-      header: "Done",
-      id: "done",
-      accessorFn: (row) => String(row.done),
-    },
+    {},
   ];
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:72:11
     },
     {
       header: "Done",
-      id: "done",
+      id: "",
       accessorFn: (row) => String(row.done),
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Columns require an id when using an accessorFn

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.jsx:73:19
     {
       header: "Done",
       id: "done",
-      accessorFn: (row) => String(row.done),
+      accessorFn: () => undefined,
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:100:15
     <OurTable
       data={requests}
       columns={columns}
-      testid={"RecommendationRequestTable"}
+      testid={""}
     />
   );
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
