[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:10
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New recommendationRequest Created - id: 17",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
