[Killed] BooleanLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:9:66
 import { toast } from "react-toastify";
 import { Navigate } from "react-router";
 
-export default function RecommendationRequestEditPage({ upsert = false }) {
+export default function RecommendationRequestEditPage({ upsert = true }) {
   let { id } = useParams();
 
killedBy: RecommendationRequestEditPage tests when the backend is up Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:29:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests when the backend is up Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:45:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(`RecommendationRequest Updated - id: ${recommendationRequest.id}`);
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests when the backend is up Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:62:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !upsert) {
+  if (true) {
     return <Navigate to="/recommendationrequest" />;
   }
killedBy: RecommendationRequestEditPage tests when the backend is up renders header but table is not present
statusReason: Unable to find an element with the text: Edit RecommendationRequest. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:62:29
     mutation.mutate(data);
   };
 
-  if (isSuccess && !upsert) {
-    return <Navigate to="/recommendationrequest" />;
-  }
+  if (isSuccess && !upsert) {}
 
   return (
killedBy: RecommendationRequestEditPage tests when the backend is up Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            initialContents={recommendationRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {recommendationRequest || <RecommendationRequestForm initialContents={recommendationRequest} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests when the backend is up is populated with the data provided
statusReason: Objects are not valid as a React child (found: object with keys {id, requesterEmail, professorEmail, explanation, dateRequested, dateNeeded, done}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            initialContents={recommendationRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests when the backend is up is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
