[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:27:30
     ? recommendationRequests
     : [];
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/recommendationrequest/create"
-          // Stryker disable next-line all : CSS floating not critical to test
-          style={{ float: "right" }}
-        >
-          Create RecommendationRequest
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create RecommendationRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
