[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:6:28
 import { useNavigate } from "react-router";
 
 // eslint-disable-next-line react-refresh/only-export-components
-export const email_regex = /\S+@\S+\.\S+/;
+export const email_regex = /\S+@\S+\.\S/;
 // eslint-disable-next-line react-refresh/only-export-components
 export const isodate_regex =
killedBy: RecommendationRequestForm tests email_regex works correctly
statusReason: expected 'abc@def.g' to be 'abc@def.ghi' // Object.is equality

[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:9:3
 export const email_regex = /\S+@\S+\.\S+/;
 // eslint-disable-next-line react-refresh/only-export-components
 export const isodate_regex =
-  /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+  /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\D)/i;
 
 function RecommendationRequestForm({
killedBy: RecommendationRequestForm tests isodate_regex works correctly
statusReason: expected undefined to be '2022-01-01T23:59' // Object.is equality

[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:9:3
 export const email_regex = /\S+@\S+\.\S+/;
 // eslint-disable-next-line react-refresh/only-export-components
 export const isodate_regex =
-  /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+  /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[^01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
 function RecommendationRequestForm({
killedBy: RecommendationRequestForm tests isodate_regex works correctly
statusReason: expected undefined to be '2022-01-01T23:59' // Object.is equality

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} readOnly />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: RecommendationRequestEditPage tests when the backend is up is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:27:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: RecommendationRequestEditPage tests when the backend is up is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "RequesterEmail is required. "}
+              {false}
               {errors.requesterEmail?.type === "pattern" &&
                 "RequesterEmail must be a valid email."}
killedBy: RecommendationRequestForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /RequesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "RequesterEmail is required. "}
+              {errors.requesterEmail || "RequesterEmail is required. "}
               {errors.requesterEmail?.type === "pattern" &&
                 "RequesterEmail must be a valid email."}
killedBy: RecommendationRequestForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /ProfessorEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:58:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail.type === "pattern" &&
                 "RequesterEmail must be a valid email."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:58:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail?.type !== "pattern" &&
                 "RequesterEmail must be a valid email."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  RequesterEmail must be a valid email.
</div> instead

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:59:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required. "}
               {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email."}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Unable to find an element with the text: /RequesterEmail must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "ProfessorEmail is required. "}
+              {true}
               {errors.professorEmail?.type === "pattern" &&
                 "ProfessorEmail must be a valid email."}
killedBy: RecommendationRequestForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /ProfessorEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "ProfessorEmail is required. "}
+              {errors.professorEmail || "ProfessorEmail is required. "}
               {errors.professorEmail?.type === "pattern" &&
                 "ProfessorEmail must be a valid email."}
killedBy: RecommendationRequestForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /RequesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:78:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "ProfessorEmail is required. "}
-              {errors.professorEmail?.type === "pattern" &&
-                "ProfessorEmail must be a valid email."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Unable to find an element with the text: /ProfessorEmail must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:78:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "ProfessorEmail is required. "}
-              {errors.professorEmail?.type === "pattern" &&
+              {errors.professorEmail.type === "pattern" &&
                 "ProfessorEmail must be a valid email."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:132:42
               id="dateNeeded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateNeeded)}
-              {...register("dateNeeded", {
-                required: "DateNeeded is required.",
-                pattern: isodate_regex,
-              })}
+              {...register("dateNeeded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /DateNeeded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:149:28
               data-testid="RecommendationRequestForm-done"
               id="done"
               type="checkbox"
-              {...register("done")}
+              {...register("")}
             />
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')
