[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:89:21
                 pattern: {
                   value: url_regex,
                   message:
-                    "URL must be a valid URL starting with http:// or https://",
+                    "",
                 },
               })}
killedBy: ArticlesForm tests that the correct validations are performed on bad input
statusReason: Unable to find an element with the text: /URL must be a valid URL starting with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:129:37
               id="email"
               type="text"
               isInvalid={Boolean(errors.email)}
-              {...register("email", {
-                required: "Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Email must be a valid email address",
-                },
-              })}
+              {...register("email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed on missing input
statusReason: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:131:26
               isInvalid={Boolean(errors.email)}
               {...register("email", {
                 required: "Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Email must be a valid email address",
-                },
+                pattern: {},
               })}
             />
killedBy: ArticlesForm tests that the correct validations are performed on bad input
statusReason: Unable to find an element with the text: /Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
