[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:32:35
           type="text"
           isInvalid={Boolean(errors.orgCode)}
           disabled={Boolean(initialContents)}
-          {...register("orgCode", {
-            required: "Org Code is required.",
-          })}
+          {...register("orgCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Org Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:77:39
 
       <Form.Group className="mb-3">
         <Form.Check
-          data-testid={testIdPrefix + "-inactive"}
+          data-testid={testIdPrefix + ""}
           id="inactive"
           type="checkbox"
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
