[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:9:35
 import { hasRole } from "main/utils/useCurrentUser";
 import { toast } from "react-toastify";
 
-function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+function onDeleteSuccess(message) {}
 
 function cellToAxiosParamsDelete(cell) {
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:14:40
   toast(message);
 }
 
-function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/UCSBOrganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  };
-}
+function cellToAxiosParamsDelete(cell) {}
 
 export default function UCSBOrganizationTable({
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:15:10
 }
 
 function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/UCSBOrganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:31:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.original.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/ucsborganization/edit/ARTS' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:54:5
       header: "Org Code",
       accessorKey: "orgCode",
     },
-    {
-      header: "Org Translation Short",
-      accessorKey: "orgTranslationShort",
-    },
+    {},
     {
       header: "Org Translation",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:55:15
       accessorKey: "orgCode",
     },
     {
-      header: "Org Translation Short",
+      header: "",
       accessorKey: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Org Translation Short. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:59:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "Org Translation",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Org Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:62:5
       header: "Org Translation",
       accessorKey: "orgTranslation",
     },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
