[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.jsx:3:53
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBOrganizationIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>UCSBOrganization Index page not yet implemented</h1>
-        <p>
-          <a href="/ucsborganization/create">Create</a>
-        </p>
-        <p>
-          <a href="/ucsborganization/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function UCSBOrganizationIndexPage() {}
 
killedBy: UCSBOrganizationIndexPage tests Renders expected content
statusReason: Unable to find an element with the text: UCSBOrganization Index page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
